output/posts/2017-08-04-indirect-register-access/index.html
<!DOCTYPE html>
<html prefix="
og: http://ogp.me/ns#
article: http://ogp.me/ns/article#
" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Indirect Register Access | Yao He's Awesome Site</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://stephen0921.github.io/posts/2017-08-04-indirect-register-access/">
<!--[if lt IE 9]>
        <![endif]--><meta name="author" content="Yao He">
<link rel="prev" href="../2017-08-02-json-validator/" title="JSON Validator" type="text/html">
<link rel="next" href="../2017-08-07-uvm-factory/" title="Uvm Factory Mechanism" type="text/html">
<meta property="og:site_name" content="Yao He's Awesome Site">
<meta property="og:title" content="Indirect Register Access">
<meta property="og:url" content="https://stephen0921.github.io/posts/2017-08-04-indirect-register-access/">
<meta property="og:description" content="序


UVM register model为我们的寄存器验证提供了很大的帮助，多种集成register model的方法，尤其是使用layered register sequencer的方法，方便了间接访问寄存器的验证。





uvm_users_guide_1.1的例子分析


参考第5.9.2.3小节，


// translation sequence type
typedef uvm">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-08-04T18:17:15+08:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar  header-panel shadow-z-3" role="navigation"><div class="container-fluid">
        <div class="row">
          <div class="col-xs-3">
            <h1 class="title-blog">
                <a href="https://stephen0921.github.io/">
                        <span id="blog-title">Yao He's Awesome Site</span>
                    </a>
            </h1>
          </div>
          <div class="col-xs-9">
            <a id="hamburger" class="btn btn-raised" href="javascript:void(0);" onclick="menuToggle();">☰</a>
          </div>
        </div>
      </div>
<!-- /.container-fluid -->
</nav><div class="container-fluid main" id="content" role="main">
        <div class="row">
            <nav class="col-xs-12 col-sm-3 menu"><ul>
<li class="withripple"><a href="../../archive.html">Archive</a></li>
                <li class="withripple"><a href="../../categories/">Tags</a></li>
                <li class="withripple"><a href="../../rss.xml">RSS feed</a></li>

                    
                </ul>
<ul></ul></nav><div class="posts-material col-xs-12 col-sm-9">
                <div class="col-xs-12 col-md-11 content-material">
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Indirect Register Access</a></h1>
<hr>
<div class="metadata">
            <span class="byline author vcard">
                <a href=".">
                        <i class="mdi-action-face-unlock"></i>
                    Yao He
                </a>
            </span>
            <span class="dateline">
                <a href="." rel="bookmark"><i class="mdi-device-access-time"></i>
                    <time class="published dt-published" datetime="2017-08-04T18:17:15+08:00" itemprop="datePublished" title="2017-08-04 18:17">2017-08-04 18:17</time></a>
            </span>
        </div>
        
        <hr></header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">序</h2>
<div class="outline-text-2" id="text-1">
<p>
UVM register model为我们的寄存器验证提供了很大的帮助，多种集成register model的方法，尤其是使用layered register sequencer的方法，方便了间接访问寄存器的验证。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">uvm_users_guide_1.1的例子分析</h2>
<div class="outline-text-2" id="text-2">
<p>
参考第5.9.2.3小节，
</p>

<div class="highlight"><pre><span></span><span class="o">//</span> <span class="n">translation</span> <span class="n">sequence</span> <span class="nb">type</span>
<span class="n">typedef</span> <span class="n">uvm_reg_sequence</span> <span class="c1">#(uvm_sequence #(apb_rw)) reg2apb_seq_t;</span>

<span class="k">class</span> <span class="nc">block_env</span> <span class="n">extends</span> <span class="n">uvm_env</span><span class="p">;</span>
  <span class="n">block_reg_model</span> <span class="n">regmodel</span><span class="p">;</span>
  <span class="n">uvm_sequencer</span><span class="c1">#(uvm_reg_item) reg_seqr;</span>
  <span class="n">apb_agent</span> <span class="n">apb</span><span class="p">;</span>
  <span class="n">reg2apb_seq_t</span> <span class="n">reg2apb_seq</span><span class="p">;</span>

  <span class="n">virtual</span> <span class="n">function</span> <span class="n">void</span> <span class="n">connect</span><span class="p">();</span>
    <span class="k">if</span> <span class="p">(</span><span class="n">regmodel</span><span class="o">.</span><span class="n">get_parent</span><span class="p">()</span> <span class="o">==</span> <span class="n">null</span><span class="p">)</span> <span class="n">begin</span>
      <span class="n">regmodel</span><span class="o">.</span><span class="n">default_map</span><span class="o">.</span><span class="n">set_sequencer</span><span class="p">(</span><span class="n">reg_seqr</span><span class="p">,</span><span class="n">null</span><span class="p">);</span>
      <span class="n">reg2apb_seq</span> <span class="o">=</span> <span class="n">reg2apb_seq_t</span><span class="p">::</span><span class="n">type_id</span><span class="p">::</span><span class="n">create</span><span class="p">(</span><span class="s2">"reg2apb_seq"</span><span class="p">,,</span><span class="n">get_full_name</span><span class="p">());</span>
      <span class="n">reg2apb_seq</span><span class="o">.</span><span class="n">reg_seqr</span> <span class="o">=</span> <span class="n">reg_seqr</span><span class="p">;</span>
      <span class="n">reg2apb_seq</span><span class="o">.</span><span class="n">adapter</span> <span class="o">=</span>
      <span class="n">reg2apb_adapter</span><span class="p">::</span><span class="n">type_id</span><span class="p">::</span><span class="n">create</span><span class="p">(</span><span class="s2">"reg2apb"</span><span class="p">,,</span><span class="n">get_full_name</span><span class="p">());</span>
      <span class="n">regmodel</span><span class="o">.</span><span class="n">set_auto_predict</span><span class="p">(</span><span class="mi">1</span><span class="p">);</span>
    <span class="n">end</span>
  <span class="n">endfunction</span>

  <span class="n">virtual</span> <span class="n">task</span> <span class="n">run</span><span class="p">();</span>
    <span class="n">reg2apb_seq</span><span class="o">.</span><span class="n">start</span><span class="p">(</span><span class="n">apb</span><span class="o">.</span><span class="n">sequencer</span><span class="p">);</span>
  <span class="n">endtask</span>
<span class="n">endclass</span>
</pre></div>

<p>
中间层sequencer上的sequence item类型是uvm_reg_item，也即是寄存器的读或者写操作了，其是class。
在test里，start translation sequence。
</p>

<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">my_test</span> <span class="n">extends</span> <span class="n">uvm_test</span><span class="p">;</span>
  <span class="n">block_env</span> <span class="n">env</span><span class="p">;</span>
  <span class="n">virtual</span> <span class="n">function</span> <span class="n">void</span> <span class="n">run</span><span class="p">();</span>
    <span class="n">my_reg_sequence</span> <span class="n">seq</span> <span class="o">=</span> <span class="n">my_reg_sequence</span><span class="p">::</span><span class="n">type_id</span><span class="p">::</span><span class="n">create</span><span class="p">(</span><span class="s2">"seq"</span><span class="p">,</span><span class="n">this</span><span class="p">);</span>
    <span class="n">seq</span><span class="o">.</span><span class="n">start</span><span class="p">(</span><span class="n">env</span><span class="o">.</span><span class="n">reg_seqr</span><span class="p">);</span>
  <span class="n">endfunction</span>
<span class="n">endclass</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">实际问题</h2>
<div class="outline-text-2" id="text-3">
<p>
在我的实际应用中，是想把一个寄存器操作，转化为多个寄存器的读和写。这里，我把间接寄存器放在了一个独立的register map上(名为UnAddressedModules)，而不是default map。
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">wifi_t</span> <span class="n">extends</span> <span class="n">uvm_reg_block</span><span class="p">;</span>
<span class="o">...</span>
  <span class="n">uvm_reg_map</span> <span class="n">wifi_top</span><span class="p">;</span>
  <span class="n">uvm_reg_map</span> <span class="n">UnAddressedModules</span><span class="p">;</span>
<span class="o">...</span>
  <span class="n">virtual</span> <span class="n">function</span> <span class="n">void</span> <span class="n">build</span><span class="p">();</span>
    <span class="n">wifi_top</span> <span class="o">=</span> <span class="n">create_map</span><span class="p">(</span><span class="s2">"wifi_top"</span><span class="p">,</span> <span class="s1">'h0, 4, UVM_LITTLE_ENDIAN, 1);</span>
    <span class="n">UnAddressedModules</span> <span class="o">=</span> <span class="n">create_map</span><span class="p">(</span><span class="s2">"UnAddressedModules"</span><span class="p">,</span> <span class="s1">'h0, 4, UVM_LITTLE_ENDIAN, 1);</span>
    <span class="n">default_map</span> <span class="o">=</span> <span class="n">wifi_top</span><span class="p">;</span>
<span class="o">...</span>    
<span class="n">endclass</span>
</pre></div>

<p>
在env中，集成register model以及构建layer sequence。
</p>
<div class="highlight"><pre><span></span><span class="n">virtual</span> <span class="n">function</span> <span class="n">void</span> <span class="n">build_phase</span><span class="p">(</span><span class="n">uvm_phase</span> <span class="n">phase</span><span class="p">);</span>
    <span class="n">reg_seqr</span> <span class="o">=</span> <span class="n">uvm_sequencer</span><span class="c1">#(uvm_reg_item)::type_id::create("reg_seqr", this);</span>

    <span class="n">rdb</span> <span class="o">=</span> <span class="n">wifi_t</span><span class="p">::</span><span class="n">type_id</span><span class="p">::</span><span class="n">create</span><span class="p">(</span><span class="s2">"rdb"</span><span class="p">,</span> <span class="n">this</span><span class="p">);</span>
    <span class="n">rdb</span><span class="o">.</span><span class="n">configure</span><span class="p">(</span><span class="n">null</span><span class="p">,</span><span class="s2">""</span><span class="p">);</span>
    <span class="n">rdb</span><span class="o">.</span><span class="n">build</span><span class="p">();</span>
    <span class="n">rdb</span><span class="o">.</span><span class="n">reset</span><span class="p">();</span>
    <span class="n">rdb</span><span class="o">.</span><span class="n">lock_model</span><span class="p">();</span>
  <span class="n">endfunction</span>

  <span class="n">virtual</span> <span class="n">function</span> <span class="n">void</span> <span class="n">connect_phase</span><span class="p">(</span><span class="n">uvm_phase</span> <span class="n">phase</span><span class="p">);</span>
    <span class="nb">super</span><span class="o">.</span><span class="n">connect_phase</span><span class="p">(</span><span class="n">phase</span><span class="p">);</span>

    <span class="n">vsequencer</span><span class="o">.</span><span class="n">ahb_master_sqr</span> <span class="o">=</span> <span class="n">ahb_master_uvc</span><span class="o">.</span><span class="n">sequencer</span><span class="p">;</span>
    <span class="n">vsequencer</span><span class="o">.</span><span class="n">reg_seqr</span>       <span class="o">=</span> <span class="n">reg_seqr</span><span class="p">;</span>
    <span class="n">rdb</span><span class="o">.</span><span class="n">default_map</span><span class="o">.</span><span class="n">set_sequencer</span><span class="p">(</span><span class="n">vsequencer</span><span class="o">.</span><span class="n">ahb_master_sqr</span><span class="p">,</span> <span class="n">reg2ahb</span><span class="p">);</span>
    <span class="n">rdb</span><span class="o">.</span><span class="n">default_map</span><span class="o">.</span><span class="n">set_auto_predict</span><span class="p">(</span><span class="mi">1</span><span class="p">);</span>

    <span class="n">rdb</span><span class="o">.</span><span class="n">UnAddressedModules</span><span class="o">.</span><span class="n">set_sequencer</span><span class="p">(</span><span class="n">reg_seqr</span><span class="p">,</span><span class="n">null</span><span class="p">);</span> <span class="o">//</span> <span class="n">note</span> <span class="n">that</span> <span class="n">do</span> <span class="ow">not</span> <span class="nb">set</span> <span class="n">adapter</span> <span class="n">here</span>
    <span class="n">rdb</span><span class="o">.</span><span class="n">UnAddressedModules</span><span class="o">.</span><span class="n">set_auto_predict</span><span class="p">(</span><span class="mi">1</span><span class="p">);</span>

    <span class="n">reg_tl_seq</span> <span class="o">=</span> <span class="n">reg_tl_seq_t</span><span class="p">::</span><span class="n">type_id</span><span class="p">::</span><span class="n">create</span><span class="p">(</span><span class="s2">"reg_tl_seq"</span><span class="p">,,</span><span class="n">get_full_name</span><span class="p">());</span>
    <span class="n">req_tl_seq</span><span class="o">.</span><span class="n">reg_seqr</span> <span class="o">=</span> <span class="n">reg_seqr</span><span class="p">;</span> <span class="o">//</span> <span class="nb">set</span> <span class="n">upstream</span> <span class="n">sequencer</span>
    <span class="n">req_tl_seq</span><span class="o">.</span><span class="n">rdb</span> <span class="o">=</span> <span class="n">this</span><span class="o">.</span><span class="n">rdb</span><span class="p">;</span>
    <span class="n">req_tl_seq</span><span class="o">.</span><span class="n">adapter</span> <span class="o">=</span> <span class="n">reg2ahb</span><span class="p">;</span>
    <span class="n">reg_tl_seq</span><span class="o">.</span><span class="n">phy_bank_cfg</span> <span class="o">=</span> <span class="n">env_cfg</span><span class="o">.</span><span class="n">phy_bank_cfg</span><span class="p">;</span>

  <span class="n">endfunction</span>

  <span class="n">virtual</span> <span class="n">task</span> <span class="n">main_phase</span><span class="p">(</span><span class="n">uvm_phase</span> <span class="n">phase</span><span class="p">);</span>
    <span class="nb">super</span><span class="o">.</span><span class="n">main_phase</span><span class="p">(</span><span class="n">phase</span><span class="p">);</span>
    <span class="n">env_cfg</span><span class="o">.</span><span class="k">print</span><span class="p">();</span>
    <span class="n">reg_tl_seq</span><span class="o">.</span><span class="n">start</span><span class="p">(</span><span class="n">vsequncer</span><span class="o">.</span><span class="n">ahb_master_sqr</span><span class="p">);</span>
  <span class="n">endtask</span>
</pre></div>

<p>
回过头来，参考uvm_reg_sequence.svh。
</p>
<div class="highlight"><pre><span></span><span class="n">virtual</span> <span class="n">task</span> <span class="n">body</span><span class="p">();</span>
    <span class="o">...</span>
    <span class="n">forever</span> <span class="n">begin</span>
      <span class="n">uvm_reg_item</span> <span class="n">reg_item</span><span class="p">;</span>
      <span class="n">reg_seqr</span><span class="o">.</span><span class="n">peek</span><span class="p">(</span><span class="n">reg_item</span><span class="p">);</span>
      <span class="n">do_reg_item</span><span class="p">(</span><span class="n">reg_item</span><span class="p">);</span>
      <span class="n">reg_seqr</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="n">reg_item</span><span class="p">);</span>
      <span class="c1">#0;</span>
    <span class="n">end</span>
  <span class="n">endtask</span>
</pre></div>

<p>
所以，我自己的sequence为下面的代码，因为不是uvm_reg_sequence的子类，所以需要手动实现上面body类似代码。
</p>
<div class="highlight"><pre><span></span><span class="n">virtual</span> <span class="n">task</span> <span class="n">body</span><span class="p">();</span>
  <span class="o">...</span>
  <span class="n">forever</span> <span class="n">begin</span>
    <span class="n">uvm_reg_item</span> <span class="n">req</span><span class="p">;</span>
    <span class="n">reg_seqr</span><span class="o">.</span><span class="n">peek</span><span class="p">(</span><span class="n">req</span><span class="p">);</span>
    <span class="n">select_bank</span><span class="p">(</span><span class="mi">0</span><span class="p">);</span>
    <span class="k">if</span> <span class="p">(</span><span class="n">req</span><span class="o">.</span><span class="n">kind</span> <span class="o">==</span> <span class="n">UVM_READ</span><span class="p">)</span> <span class="n">begin</span>
      <span class="n">read_data</span><span class="p">(</span><span class="n">req</span><span class="p">);</span>
    <span class="n">end</span>
    <span class="k">else</span> <span class="n">begin</span>
      <span class="n">write_data</span><span class="p">(</span><span class="n">req</span><span class="p">);</span>
    <span class="n">end</span>
    <span class="n">reg_seqr</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="n">req</span><span class="p">);</span>
    <span class="c1">#0;</span>
    <span class="n">req</span><span class="o">.</span><span class="n">end_tr</span><span class="p">();</span>
  <span class="n">end</span>
</pre></div>

<p>
注意，reg_seqr没有对应的driver与之相连，所以要手动end_tr，否则sequence在发出第一个包后，卡住不动，因为没有consume掉这个transaction。可以参考代码uvm_reg_map.svh。
</p>
<div class="highlight"><pre><span></span><span class="n">task</span> <span class="n">uvm_reg_map</span><span class="p">::</span><span class="n">do_write</span><span class="p">(</span><span class="n">uvm_reg_item</span> <span class="n">rw</span><span class="p">);</span>
  <span class="o">...</span>
  <span class="n">rw</span><span class="o">.</span><span class="n">parent</span><span class="o">.</span><span class="n">start_item</span><span class="p">(</span><span class="n">rw</span><span class="p">,</span><span class="n">rw</span><span class="o">.</span><span class="n">prior</span><span class="p">);</span>
  <span class="n">rw</span><span class="o">.</span><span class="n">parent</span><span class="o">.</span><span class="n">finish_item</span><span class="p">(</span><span class="n">rw</span><span class="p">);</span>
  <span class="n">rw</span><span class="o">.</span><span class="n">end_event</span><span class="o">.</span><span class="n">wait_on</span><span class="p">();</span><span class="o">//</span> <span class="n">wait</span> <span class="n">rw</span> <span class="n">to</span> <span class="n">be</span> <span class="n">consumed</span>
<span class="n">endtask</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">总结</h2>
<div class="outline-text-2" id="text-4">
<p>
层次化的集成register model的方法，处理间接访问寄存器，可行有效，但要注意一些小细节，比如关于transaction生命周期的。
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager">
<li class="previous">
                <a href="../2017-08-02-json-validator/" rel="prev" title="JSON Validator">Previous post</a>
            </li>
            <li class="next">
                <a href="../2017-08-07-uvm-factory/" rel="next" title="Uvm Factory Mechanism">Next post</a>
            </li>
        </ul></nav></aside><div id="container"></div>
<link rel="stylesheet" href="https://imsun.github.io/gitment/style/default.css">
<script src="https://imsun.github.io/gitment/dist/gitment.browser.js"></script><script>
var gitment = new Gitment({
  owner: 'stephen0921',
  repo: 'blogcomments',
  oauth: {
    client_id: '023e6b0f82c8769a884b',
    client_secret: '7627cf219ccd3c1eabf6071ca10ff03da3a6df93',
  },
})
gitment.render('container')
</script></article>
</div>
            </div>
        </div>
        <button class="btn btn-fab btn-raised btn-material-green btn-footer" data-toggle="modal" data-target="#footer-dialog">
            <i class="mdi-communication-message"></i>
        </button>
        <div id="footer-dialog" class="modal fade" tabindex="-1">
          <div class="modal-dialog">
            <div class="modal-content">
            <div class="modal-header">
                <button type="button" class="close" data-dismiss="modal" aria-hidden="true">×</button>
                <h4 class="modal-title">Yao He's Awesome Site credits</h4>
              </div>
              <div class="modal-body">
                    Contents © 2017         <a href="mailto:stephen0921@gmail.com">Yao He</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
              </div>
              <div class="modal-footer">
                <button class="btn btn-primary" data-dismiss="modal">Ok</button>
              </div>
            </div>
          </div>
        </div>
        <div class="source-button">
    <a class="btn btn-fab btn-raised btn-material-indigo" target="_blank" href="index.org" title="Source">
        <i class="mdi-file-cloud-download"></i>
    </a>

        </div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>

            $(document).ready(function() {
                // This command is used to initialize some elements and make them work properly
                $.material.init();
            });

            $(window).on("resize", function() {
                if($(window).width() > 767) {
                  $("html, body").height($(window).height());
                  $(".main, .menu").height($(window).height() - $(".header-panel").outerHeight() - 76 );
                  $(".posts-material").height($(window).height());
                } else {
                  $("html, body").css('height', '');
                  $(".main, .menu").css('height', '');
                  $(".posts-material").css('height', '');
                }
            }).trigger("resize");

            function menuToggle() {
                $("nav.menu, ul").toggleClass('responsive', '');
            }
        </script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
